vgroenhuis/LynXP/Firmware/ESP32_S3_CAM_IDF/sdkconfig.defaults
# XIAO ESP32S3 Sense: ESP32-S3R8 with 8MB octal PSRAM, 8MB flash.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# app_main() does WiFi scan/connect + camera init + logging synchronously on the
# main task before starting anything else - default 3584B stack is too tight for
# that plus the esp_wifi/esp_camera call chains.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Default (10) is tight once the /stream server's max_open_sockets is bumped
# to MAX_STREAM_CLIENTS+1=5 for multi-viewer support, on top of the main
# server's own default ~7 - raise the ceiling so both servers' sockets can't
# collectively exceed it under load.
CONFIG_LWIP_MAX_SOCKETS=16
